# ####################################################################

#  Created by Genus(TM) Synthesis Solution 18.11-s009_1 on Fri May 03 15:04:28 -03 2019

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design Router

create_clock -name "clock" -period 2.0 -waveform {0.0 1.0} [get_ports clock]
set_load -pin_load -min 0.0014 [get_ports {credit_o[4]}]
set_load -pin_load -max 0.32 [get_ports {credit_o[4]}]
set_load -pin_load -min 0.0014 [get_ports {credit_o[3]}]
set_load -pin_load -max 0.32 [get_ports {credit_o[3]}]
set_load -pin_load -min 0.0014 [get_ports {credit_o[2]}]
set_load -pin_load -max 0.32 [get_ports {credit_o[2]}]
set_load -pin_load -min 0.0014 [get_ports {credit_o[1]}]
set_load -pin_load -max 0.32 [get_ports {credit_o[1]}]
set_load -pin_load -min 0.0014 [get_ports {credit_o[0]}]
set_load -pin_load -max 0.32 [get_ports {credit_o[0]}]
set_load -pin_load -min 0.0014 [get_ports {clock_tx[4]}]
set_load -pin_load -max 0.32 [get_ports {clock_tx[4]}]
set_load -pin_load -min 0.0014 [get_ports {clock_tx[3]}]
set_load -pin_load -max 0.32 [get_ports {clock_tx[3]}]
set_load -pin_load -min 0.0014 [get_ports {clock_tx[2]}]
set_load -pin_load -max 0.32 [get_ports {clock_tx[2]}]
set_load -pin_load -min 0.0014 [get_ports {clock_tx[1]}]
set_load -pin_load -max 0.32 [get_ports {clock_tx[1]}]
set_load -pin_load -min 0.0014 [get_ports {clock_tx[0]}]
set_load -pin_load -max 0.32 [get_ports {clock_tx[0]}]
set_load -pin_load -min 0.0014 [get_ports {tx[4]}]
set_load -pin_load -max 0.32 [get_ports {tx[4]}]
set_load -pin_load -min 0.0014 [get_ports {tx[3]}]
set_load -pin_load -max 0.32 [get_ports {tx[3]}]
set_load -pin_load -min 0.0014 [get_ports {tx[2]}]
set_load -pin_load -max 0.32 [get_ports {tx[2]}]
set_load -pin_load -min 0.0014 [get_ports {tx[1]}]
set_load -pin_load -max 0.32 [get_ports {tx[1]}]
set_load -pin_load -min 0.0014 [get_ports {tx[0]}]
set_load -pin_load -max 0.32 [get_ports {tx[0]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][63]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][63]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][62]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][62]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][61]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][61]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][60]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][60]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][59]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][59]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][58]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][58]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][57]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][57]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][56]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][56]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][55]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][55]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][54]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][54]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][53]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][53]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][52]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][52]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][51]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][51]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][50]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][50]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][49]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][49]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][48]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][48]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][47]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][47]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][46]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][46]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][45]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][45]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][44]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][44]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][43]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][43]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][42]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][42]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][41]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][41]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][40]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][40]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][39]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][39]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][38]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][38]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][37]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][37]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][36]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][36]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][35]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][35]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][34]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][34]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][33]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][33]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][32]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][32]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][31]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][31]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][30]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][30]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][29]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][29]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][28]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][28]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][27]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][27]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][26]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][26]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][25]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][25]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][24]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][24]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][23]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][23]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][22]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][22]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][21]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][21]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][20]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][20]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][19]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][19]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][18]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][18]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][17]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][17]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][16]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][16]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][15]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][15]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][14]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][14]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][13]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][13]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][12]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][12]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][11]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][11]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][10]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][10]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][9]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][9]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][8]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][8]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][7]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][7]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][6]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][6]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][5]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][5]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][4]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][4]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][3]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][3]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][2]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][2]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][1]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][1]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[0][0]}]
set_load -pin_load -max 0.32 [get_ports {data_out[0][0]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][63]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][63]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][62]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][62]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][61]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][61]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][60]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][60]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][59]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][59]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][58]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][58]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][57]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][57]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][56]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][56]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][55]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][55]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][54]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][54]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][53]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][53]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][52]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][52]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][51]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][51]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][50]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][50]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][49]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][49]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][48]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][48]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][47]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][47]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][46]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][46]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][45]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][45]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][44]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][44]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][43]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][43]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][42]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][42]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][41]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][41]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][40]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][40]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][39]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][39]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][38]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][38]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][37]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][37]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][36]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][36]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][35]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][35]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][34]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][34]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][33]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][33]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][32]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][32]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][31]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][31]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][30]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][30]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][29]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][29]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][28]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][28]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][27]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][27]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][26]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][26]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][25]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][25]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][24]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][24]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][23]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][23]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][22]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][22]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][21]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][21]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][20]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][20]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][19]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][19]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][18]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][18]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][17]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][17]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][16]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][16]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][15]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][15]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][14]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][14]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][13]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][13]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][12]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][12]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][11]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][11]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][10]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][10]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][9]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][9]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][8]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][8]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][7]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][7]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][6]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][6]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][5]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][5]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][4]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][4]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][3]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][3]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][2]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][2]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][1]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][1]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[1][0]}]
set_load -pin_load -max 0.32 [get_ports {data_out[1][0]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][63]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][63]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][62]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][62]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][61]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][61]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][60]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][60]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][59]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][59]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][58]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][58]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][57]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][57]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][56]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][56]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][55]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][55]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][54]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][54]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][53]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][53]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][52]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][52]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][51]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][51]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][50]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][50]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][49]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][49]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][48]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][48]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][47]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][47]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][46]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][46]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][45]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][45]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][44]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][44]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][43]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][43]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][42]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][42]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][41]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][41]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][40]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][40]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][39]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][39]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][38]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][38]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][37]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][37]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][36]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][36]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][35]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][35]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][34]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][34]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][33]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][33]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][32]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][32]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][31]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][31]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][30]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][30]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][29]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][29]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][28]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][28]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][27]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][27]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][26]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][26]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][25]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][25]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][24]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][24]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][23]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][23]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][22]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][22]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][21]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][21]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][20]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][20]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][19]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][19]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][18]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][18]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][17]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][17]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][16]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][16]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][15]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][15]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][14]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][14]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][13]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][13]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][12]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][12]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][11]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][11]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][10]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][10]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][9]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][9]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][8]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][8]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][7]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][7]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][6]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][6]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][5]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][5]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][4]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][4]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][3]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][3]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][2]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][2]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][1]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][1]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[2][0]}]
set_load -pin_load -max 0.32 [get_ports {data_out[2][0]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][63]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][63]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][62]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][62]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][61]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][61]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][60]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][60]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][59]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][59]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][58]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][58]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][57]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][57]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][56]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][56]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][55]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][55]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][54]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][54]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][53]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][53]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][52]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][52]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][51]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][51]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][50]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][50]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][49]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][49]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][48]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][48]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][47]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][47]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][46]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][46]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][45]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][45]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][44]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][44]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][43]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][43]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][42]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][42]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][41]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][41]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][40]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][40]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][39]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][39]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][38]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][38]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][37]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][37]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][36]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][36]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][35]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][35]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][34]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][34]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][33]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][33]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][32]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][32]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][31]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][31]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][30]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][30]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][29]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][29]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][28]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][28]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][27]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][27]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][26]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][26]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][25]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][25]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][24]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][24]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][23]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][23]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][22]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][22]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][21]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][21]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][20]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][20]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][19]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][19]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][18]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][18]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][17]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][17]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][16]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][16]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][15]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][15]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][14]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][14]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][13]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][13]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][12]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][12]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][11]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][11]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][10]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][10]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][9]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][9]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][8]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][8]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][7]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][7]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][6]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][6]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][5]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][5]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][4]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][4]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][3]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][3]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][2]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][2]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][1]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][1]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[3][0]}]
set_load -pin_load -max 0.32 [get_ports {data_out[3][0]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][63]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][63]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][62]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][62]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][61]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][61]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][60]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][60]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][59]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][59]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][58]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][58]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][57]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][57]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][56]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][56]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][55]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][55]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][54]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][54]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][53]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][53]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][52]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][52]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][51]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][51]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][50]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][50]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][49]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][49]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][48]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][48]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][47]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][47]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][46]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][46]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][45]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][45]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][44]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][44]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][43]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][43]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][42]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][42]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][41]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][41]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][40]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][40]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][39]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][39]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][38]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][38]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][37]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][37]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][36]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][36]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][35]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][35]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][34]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][34]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][33]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][33]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][32]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][32]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][31]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][31]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][30]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][30]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][29]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][29]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][28]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][28]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][27]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][27]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][26]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][26]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][25]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][25]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][24]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][24]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][23]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][23]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][22]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][22]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][21]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][21]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][20]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][20]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][19]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][19]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][18]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][18]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][17]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][17]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][16]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][16]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][15]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][15]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][14]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][14]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][13]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][13]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][12]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][12]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][11]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][11]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][10]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][10]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][9]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][9]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][8]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][8]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][7]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][7]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][6]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][6]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][5]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][5]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][4]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][4]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][3]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][3]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][2]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][2]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][1]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][1]}]
set_load -pin_load -min 0.0014 [get_ports {data_out[4][0]}]
set_load -pin_load -max 0.32 [get_ports {data_out[4][0]}]
set_false_path -from [get_ports reset]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clock] -network_latency_included -add_delay -rise -min 0.0 [get_ports clock]
set_input_delay -clock [get_clocks clock] -clock_fall -network_latency_included -add_delay -fall -min 0.0 [get_ports clock]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports clock]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports reset]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {rx[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {rx[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {rx[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {rx[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {rx[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][63]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][62]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][61]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][60]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][59]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][58]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][57]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][56]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][55]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][54]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][53]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][52]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][51]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][50]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][49]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][48]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][47]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][46]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][45]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][44]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][43]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][42]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][41]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][40]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][39]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][38]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][37]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][36]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][35]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][34]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][33]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][32]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[0][0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][63]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][62]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][61]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][60]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][59]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][58]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][57]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][56]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][55]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][54]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][53]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][52]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][51]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][50]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][49]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][48]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][47]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][46]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][45]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][44]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][43]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][42]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][41]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][40]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][39]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][38]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][37]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][36]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][35]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][34]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][33]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][32]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[1][0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][63]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][62]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][61]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][60]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][59]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][58]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][57]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][56]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][55]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][54]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][53]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][52]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][51]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][50]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][49]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][48]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][47]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][46]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][45]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][44]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][43]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][42]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][41]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][40]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][39]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][38]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][37]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][36]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][35]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][34]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][33]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][32]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[2][0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][63]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][62]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][61]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][60]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][59]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][58]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][57]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][56]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][55]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][54]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][53]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][52]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][51]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][50]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][49]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][48]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][47]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][46]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][45]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][44]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][43]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][42]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][41]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][40]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][39]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][38]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][37]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][36]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][35]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][34]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][33]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][32]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[3][0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][63]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][62]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][61]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][60]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][59]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][58]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][57]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][56]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][55]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][54]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][53]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][52]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][51]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][50]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][49]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][48]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][47]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][46]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][45]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][44]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][43]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][42]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][41]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][40]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][39]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][38]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][37]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][36]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][35]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][34]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][33]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][32]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {data_in[4][0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {credit_i[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {credit_i[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {credit_i[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {credit_i[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 0.2 [get_ports {credit_i[0]}]
set_input_transition -min 0.003 [get_ports clock]
set_input_transition -max 0.16 [get_ports clock]
set_input_transition -min 0.003 [get_ports reset]
set_input_transition -max 0.16 [get_ports reset]
set_input_transition -min 0.003 [get_ports {rx[4]}]
set_input_transition -max 0.16 [get_ports {rx[4]}]
set_input_transition -min 0.003 [get_ports {rx[3]}]
set_input_transition -max 0.16 [get_ports {rx[3]}]
set_input_transition -min 0.003 [get_ports {rx[2]}]
set_input_transition -max 0.16 [get_ports {rx[2]}]
set_input_transition -min 0.003 [get_ports {rx[1]}]
set_input_transition -max 0.16 [get_ports {rx[1]}]
set_input_transition -min 0.003 [get_ports {rx[0]}]
set_input_transition -max 0.16 [get_ports {rx[0]}]
set_input_transition -min 0.003 [get_ports {data_in[0][63]}]
set_input_transition -max 0.16 [get_ports {data_in[0][63]}]
set_input_transition -min 0.003 [get_ports {data_in[0][62]}]
set_input_transition -max 0.16 [get_ports {data_in[0][62]}]
set_input_transition -min 0.003 [get_ports {data_in[0][61]}]
set_input_transition -max 0.16 [get_ports {data_in[0][61]}]
set_input_transition -min 0.003 [get_ports {data_in[0][60]}]
set_input_transition -max 0.16 [get_ports {data_in[0][60]}]
set_input_transition -min 0.003 [get_ports {data_in[0][59]}]
set_input_transition -max 0.16 [get_ports {data_in[0][59]}]
set_input_transition -min 0.003 [get_ports {data_in[0][58]}]
set_input_transition -max 0.16 [get_ports {data_in[0][58]}]
set_input_transition -min 0.003 [get_ports {data_in[0][57]}]
set_input_transition -max 0.16 [get_ports {data_in[0][57]}]
set_input_transition -min 0.003 [get_ports {data_in[0][56]}]
set_input_transition -max 0.16 [get_ports {data_in[0][56]}]
set_input_transition -min 0.003 [get_ports {data_in[0][55]}]
set_input_transition -max 0.16 [get_ports {data_in[0][55]}]
set_input_transition -min 0.003 [get_ports {data_in[0][54]}]
set_input_transition -max 0.16 [get_ports {data_in[0][54]}]
set_input_transition -min 0.003 [get_ports {data_in[0][53]}]
set_input_transition -max 0.16 [get_ports {data_in[0][53]}]
set_input_transition -min 0.003 [get_ports {data_in[0][52]}]
set_input_transition -max 0.16 [get_ports {data_in[0][52]}]
set_input_transition -min 0.003 [get_ports {data_in[0][51]}]
set_input_transition -max 0.16 [get_ports {data_in[0][51]}]
set_input_transition -min 0.003 [get_ports {data_in[0][50]}]
set_input_transition -max 0.16 [get_ports {data_in[0][50]}]
set_input_transition -min 0.003 [get_ports {data_in[0][49]}]
set_input_transition -max 0.16 [get_ports {data_in[0][49]}]
set_input_transition -min 0.003 [get_ports {data_in[0][48]}]
set_input_transition -max 0.16 [get_ports {data_in[0][48]}]
set_input_transition -min 0.003 [get_ports {data_in[0][47]}]
set_input_transition -max 0.16 [get_ports {data_in[0][47]}]
set_input_transition -min 0.003 [get_ports {data_in[0][46]}]
set_input_transition -max 0.16 [get_ports {data_in[0][46]}]
set_input_transition -min 0.003 [get_ports {data_in[0][45]}]
set_input_transition -max 0.16 [get_ports {data_in[0][45]}]
set_input_transition -min 0.003 [get_ports {data_in[0][44]}]
set_input_transition -max 0.16 [get_ports {data_in[0][44]}]
set_input_transition -min 0.003 [get_ports {data_in[0][43]}]
set_input_transition -max 0.16 [get_ports {data_in[0][43]}]
set_input_transition -min 0.003 [get_ports {data_in[0][42]}]
set_input_transition -max 0.16 [get_ports {data_in[0][42]}]
set_input_transition -min 0.003 [get_ports {data_in[0][41]}]
set_input_transition -max 0.16 [get_ports {data_in[0][41]}]
set_input_transition -min 0.003 [get_ports {data_in[0][40]}]
set_input_transition -max 0.16 [get_ports {data_in[0][40]}]
set_input_transition -min 0.003 [get_ports {data_in[0][39]}]
set_input_transition -max 0.16 [get_ports {data_in[0][39]}]
set_input_transition -min 0.003 [get_ports {data_in[0][38]}]
set_input_transition -max 0.16 [get_ports {data_in[0][38]}]
set_input_transition -min 0.003 [get_ports {data_in[0][37]}]
set_input_transition -max 0.16 [get_ports {data_in[0][37]}]
set_input_transition -min 0.003 [get_ports {data_in[0][36]}]
set_input_transition -max 0.16 [get_ports {data_in[0][36]}]
set_input_transition -min 0.003 [get_ports {data_in[0][35]}]
set_input_transition -max 0.16 [get_ports {data_in[0][35]}]
set_input_transition -min 0.003 [get_ports {data_in[0][34]}]
set_input_transition -max 0.16 [get_ports {data_in[0][34]}]
set_input_transition -min 0.003 [get_ports {data_in[0][33]}]
set_input_transition -max 0.16 [get_ports {data_in[0][33]}]
set_input_transition -min 0.003 [get_ports {data_in[0][32]}]
set_input_transition -max 0.16 [get_ports {data_in[0][32]}]
set_input_transition -min 0.003 [get_ports {data_in[0][31]}]
set_input_transition -max 0.16 [get_ports {data_in[0][31]}]
set_input_transition -min 0.003 [get_ports {data_in[0][30]}]
set_input_transition -max 0.16 [get_ports {data_in[0][30]}]
set_input_transition -min 0.003 [get_ports {data_in[0][29]}]
set_input_transition -max 0.16 [get_ports {data_in[0][29]}]
set_input_transition -min 0.003 [get_ports {data_in[0][28]}]
set_input_transition -max 0.16 [get_ports {data_in[0][28]}]
set_input_transition -min 0.003 [get_ports {data_in[0][27]}]
set_input_transition -max 0.16 [get_ports {data_in[0][27]}]
set_input_transition -min 0.003 [get_ports {data_in[0][26]}]
set_input_transition -max 0.16 [get_ports {data_in[0][26]}]
set_input_transition -min 0.003 [get_ports {data_in[0][25]}]
set_input_transition -max 0.16 [get_ports {data_in[0][25]}]
set_input_transition -min 0.003 [get_ports {data_in[0][24]}]
set_input_transition -max 0.16 [get_ports {data_in[0][24]}]
set_input_transition -min 0.003 [get_ports {data_in[0][23]}]
set_input_transition -max 0.16 [get_ports {data_in[0][23]}]
set_input_transition -min 0.003 [get_ports {data_in[0][22]}]
set_input_transition -max 0.16 [get_ports {data_in[0][22]}]
set_input_transition -min 0.003 [get_ports {data_in[0][21]}]
set_input_transition -max 0.16 [get_ports {data_in[0][21]}]
set_input_transition -min 0.003 [get_ports {data_in[0][20]}]
set_input_transition -max 0.16 [get_ports {data_in[0][20]}]
set_input_transition -min 0.003 [get_ports {data_in[0][19]}]
set_input_transition -max 0.16 [get_ports {data_in[0][19]}]
set_input_transition -min 0.003 [get_ports {data_in[0][18]}]
set_input_transition -max 0.16 [get_ports {data_in[0][18]}]
set_input_transition -min 0.003 [get_ports {data_in[0][17]}]
set_input_transition -max 0.16 [get_ports {data_in[0][17]}]
set_input_transition -min 0.003 [get_ports {data_in[0][16]}]
set_input_transition -max 0.16 [get_ports {data_in[0][16]}]
set_input_transition -min 0.003 [get_ports {data_in[0][15]}]
set_input_transition -max 0.16 [get_ports {data_in[0][15]}]
set_input_transition -min 0.003 [get_ports {data_in[0][14]}]
set_input_transition -max 0.16 [get_ports {data_in[0][14]}]
set_input_transition -min 0.003 [get_ports {data_in[0][13]}]
set_input_transition -max 0.16 [get_ports {data_in[0][13]}]
set_input_transition -min 0.003 [get_ports {data_in[0][12]}]
set_input_transition -max 0.16 [get_ports {data_in[0][12]}]
set_input_transition -min 0.003 [get_ports {data_in[0][11]}]
set_input_transition -max 0.16 [get_ports {data_in[0][11]}]
set_input_transition -min 0.003 [get_ports {data_in[0][10]}]
set_input_transition -max 0.16 [get_ports {data_in[0][10]}]
set_input_transition -min 0.003 [get_ports {data_in[0][9]}]
set_input_transition -max 0.16 [get_ports {data_in[0][9]}]
set_input_transition -min 0.003 [get_ports {data_in[0][8]}]
set_input_transition -max 0.16 [get_ports {data_in[0][8]}]
set_input_transition -min 0.003 [get_ports {data_in[0][7]}]
set_input_transition -max 0.16 [get_ports {data_in[0][7]}]
set_input_transition -min 0.003 [get_ports {data_in[0][6]}]
set_input_transition -max 0.16 [get_ports {data_in[0][6]}]
set_input_transition -min 0.003 [get_ports {data_in[0][5]}]
set_input_transition -max 0.16 [get_ports {data_in[0][5]}]
set_input_transition -min 0.003 [get_ports {data_in[0][4]}]
set_input_transition -max 0.16 [get_ports {data_in[0][4]}]
set_input_transition -min 0.003 [get_ports {data_in[0][3]}]
set_input_transition -max 0.16 [get_ports {data_in[0][3]}]
set_input_transition -min 0.003 [get_ports {data_in[0][2]}]
set_input_transition -max 0.16 [get_ports {data_in[0][2]}]
set_input_transition -min 0.003 [get_ports {data_in[0][1]}]
set_input_transition -max 0.16 [get_ports {data_in[0][1]}]
set_input_transition -min 0.003 [get_ports {data_in[0][0]}]
set_input_transition -max 0.16 [get_ports {data_in[0][0]}]
set_input_transition -min 0.003 [get_ports {data_in[1][63]}]
set_input_transition -max 0.16 [get_ports {data_in[1][63]}]
set_input_transition -min 0.003 [get_ports {data_in[1][62]}]
set_input_transition -max 0.16 [get_ports {data_in[1][62]}]
set_input_transition -min 0.003 [get_ports {data_in[1][61]}]
set_input_transition -max 0.16 [get_ports {data_in[1][61]}]
set_input_transition -min 0.003 [get_ports {data_in[1][60]}]
set_input_transition -max 0.16 [get_ports {data_in[1][60]}]
set_input_transition -min 0.003 [get_ports {data_in[1][59]}]
set_input_transition -max 0.16 [get_ports {data_in[1][59]}]
set_input_transition -min 0.003 [get_ports {data_in[1][58]}]
set_input_transition -max 0.16 [get_ports {data_in[1][58]}]
set_input_transition -min 0.003 [get_ports {data_in[1][57]}]
set_input_transition -max 0.16 [get_ports {data_in[1][57]}]
set_input_transition -min 0.003 [get_ports {data_in[1][56]}]
set_input_transition -max 0.16 [get_ports {data_in[1][56]}]
set_input_transition -min 0.003 [get_ports {data_in[1][55]}]
set_input_transition -max 0.16 [get_ports {data_in[1][55]}]
set_input_transition -min 0.003 [get_ports {data_in[1][54]}]
set_input_transition -max 0.16 [get_ports {data_in[1][54]}]
set_input_transition -min 0.003 [get_ports {data_in[1][53]}]
set_input_transition -max 0.16 [get_ports {data_in[1][53]}]
set_input_transition -min 0.003 [get_ports {data_in[1][52]}]
set_input_transition -max 0.16 [get_ports {data_in[1][52]}]
set_input_transition -min 0.003 [get_ports {data_in[1][51]}]
set_input_transition -max 0.16 [get_ports {data_in[1][51]}]
set_input_transition -min 0.003 [get_ports {data_in[1][50]}]
set_input_transition -max 0.16 [get_ports {data_in[1][50]}]
set_input_transition -min 0.003 [get_ports {data_in[1][49]}]
set_input_transition -max 0.16 [get_ports {data_in[1][49]}]
set_input_transition -min 0.003 [get_ports {data_in[1][48]}]
set_input_transition -max 0.16 [get_ports {data_in[1][48]}]
set_input_transition -min 0.003 [get_ports {data_in[1][47]}]
set_input_transition -max 0.16 [get_ports {data_in[1][47]}]
set_input_transition -min 0.003 [get_ports {data_in[1][46]}]
set_input_transition -max 0.16 [get_ports {data_in[1][46]}]
set_input_transition -min 0.003 [get_ports {data_in[1][45]}]
set_input_transition -max 0.16 [get_ports {data_in[1][45]}]
set_input_transition -min 0.003 [get_ports {data_in[1][44]}]
set_input_transition -max 0.16 [get_ports {data_in[1][44]}]
set_input_transition -min 0.003 [get_ports {data_in[1][43]}]
set_input_transition -max 0.16 [get_ports {data_in[1][43]}]
set_input_transition -min 0.003 [get_ports {data_in[1][42]}]
set_input_transition -max 0.16 [get_ports {data_in[1][42]}]
set_input_transition -min 0.003 [get_ports {data_in[1][41]}]
set_input_transition -max 0.16 [get_ports {data_in[1][41]}]
set_input_transition -min 0.003 [get_ports {data_in[1][40]}]
set_input_transition -max 0.16 [get_ports {data_in[1][40]}]
set_input_transition -min 0.003 [get_ports {data_in[1][39]}]
set_input_transition -max 0.16 [get_ports {data_in[1][39]}]
set_input_transition -min 0.003 [get_ports {data_in[1][38]}]
set_input_transition -max 0.16 [get_ports {data_in[1][38]}]
set_input_transition -min 0.003 [get_ports {data_in[1][37]}]
set_input_transition -max 0.16 [get_ports {data_in[1][37]}]
set_input_transition -min 0.003 [get_ports {data_in[1][36]}]
set_input_transition -max 0.16 [get_ports {data_in[1][36]}]
set_input_transition -min 0.003 [get_ports {data_in[1][35]}]
set_input_transition -max 0.16 [get_ports {data_in[1][35]}]
set_input_transition -min 0.003 [get_ports {data_in[1][34]}]
set_input_transition -max 0.16 [get_ports {data_in[1][34]}]
set_input_transition -min 0.003 [get_ports {data_in[1][33]}]
set_input_transition -max 0.16 [get_ports {data_in[1][33]}]
set_input_transition -min 0.003 [get_ports {data_in[1][32]}]
set_input_transition -max 0.16 [get_ports {data_in[1][32]}]
set_input_transition -min 0.003 [get_ports {data_in[1][31]}]
set_input_transition -max 0.16 [get_ports {data_in[1][31]}]
set_input_transition -min 0.003 [get_ports {data_in[1][30]}]
set_input_transition -max 0.16 [get_ports {data_in[1][30]}]
set_input_transition -min 0.003 [get_ports {data_in[1][29]}]
set_input_transition -max 0.16 [get_ports {data_in[1][29]}]
set_input_transition -min 0.003 [get_ports {data_in[1][28]}]
set_input_transition -max 0.16 [get_ports {data_in[1][28]}]
set_input_transition -min 0.003 [get_ports {data_in[1][27]}]
set_input_transition -max 0.16 [get_ports {data_in[1][27]}]
set_input_transition -min 0.003 [get_ports {data_in[1][26]}]
set_input_transition -max 0.16 [get_ports {data_in[1][26]}]
set_input_transition -min 0.003 [get_ports {data_in[1][25]}]
set_input_transition -max 0.16 [get_ports {data_in[1][25]}]
set_input_transition -min 0.003 [get_ports {data_in[1][24]}]
set_input_transition -max 0.16 [get_ports {data_in[1][24]}]
set_input_transition -min 0.003 [get_ports {data_in[1][23]}]
set_input_transition -max 0.16 [get_ports {data_in[1][23]}]
set_input_transition -min 0.003 [get_ports {data_in[1][22]}]
set_input_transition -max 0.16 [get_ports {data_in[1][22]}]
set_input_transition -min 0.003 [get_ports {data_in[1][21]}]
set_input_transition -max 0.16 [get_ports {data_in[1][21]}]
set_input_transition -min 0.003 [get_ports {data_in[1][20]}]
set_input_transition -max 0.16 [get_ports {data_in[1][20]}]
set_input_transition -min 0.003 [get_ports {data_in[1][19]}]
set_input_transition -max 0.16 [get_ports {data_in[1][19]}]
set_input_transition -min 0.003 [get_ports {data_in[1][18]}]
set_input_transition -max 0.16 [get_ports {data_in[1][18]}]
set_input_transition -min 0.003 [get_ports {data_in[1][17]}]
set_input_transition -max 0.16 [get_ports {data_in[1][17]}]
set_input_transition -min 0.003 [get_ports {data_in[1][16]}]
set_input_transition -max 0.16 [get_ports {data_in[1][16]}]
set_input_transition -min 0.003 [get_ports {data_in[1][15]}]
set_input_transition -max 0.16 [get_ports {data_in[1][15]}]
set_input_transition -min 0.003 [get_ports {data_in[1][14]}]
set_input_transition -max 0.16 [get_ports {data_in[1][14]}]
set_input_transition -min 0.003 [get_ports {data_in[1][13]}]
set_input_transition -max 0.16 [get_ports {data_in[1][13]}]
set_input_transition -min 0.003 [get_ports {data_in[1][12]}]
set_input_transition -max 0.16 [get_ports {data_in[1][12]}]
set_input_transition -min 0.003 [get_ports {data_in[1][11]}]
set_input_transition -max 0.16 [get_ports {data_in[1][11]}]
set_input_transition -min 0.003 [get_ports {data_in[1][10]}]
set_input_transition -max 0.16 [get_ports {data_in[1][10]}]
set_input_transition -min 0.003 [get_ports {data_in[1][9]}]
set_input_transition -max 0.16 [get_ports {data_in[1][9]}]
set_input_transition -min 0.003 [get_ports {data_in[1][8]}]
set_input_transition -max 0.16 [get_ports {data_in[1][8]}]
set_input_transition -min 0.003 [get_ports {data_in[1][7]}]
set_input_transition -max 0.16 [get_ports {data_in[1][7]}]
set_input_transition -min 0.003 [get_ports {data_in[1][6]}]
set_input_transition -max 0.16 [get_ports {data_in[1][6]}]
set_input_transition -min 0.003 [get_ports {data_in[1][5]}]
set_input_transition -max 0.16 [get_ports {data_in[1][5]}]
set_input_transition -min 0.003 [get_ports {data_in[1][4]}]
set_input_transition -max 0.16 [get_ports {data_in[1][4]}]
set_input_transition -min 0.003 [get_ports {data_in[1][3]}]
set_input_transition -max 0.16 [get_ports {data_in[1][3]}]
set_input_transition -min 0.003 [get_ports {data_in[1][2]}]
set_input_transition -max 0.16 [get_ports {data_in[1][2]}]
set_input_transition -min 0.003 [get_ports {data_in[1][1]}]
set_input_transition -max 0.16 [get_ports {data_in[1][1]}]
set_input_transition -min 0.003 [get_ports {data_in[1][0]}]
set_input_transition -max 0.16 [get_ports {data_in[1][0]}]
set_input_transition -min 0.003 [get_ports {data_in[2][63]}]
set_input_transition -max 0.16 [get_ports {data_in[2][63]}]
set_input_transition -min 0.003 [get_ports {data_in[2][62]}]
set_input_transition -max 0.16 [get_ports {data_in[2][62]}]
set_input_transition -min 0.003 [get_ports {data_in[2][61]}]
set_input_transition -max 0.16 [get_ports {data_in[2][61]}]
set_input_transition -min 0.003 [get_ports {data_in[2][60]}]
set_input_transition -max 0.16 [get_ports {data_in[2][60]}]
set_input_transition -min 0.003 [get_ports {data_in[2][59]}]
set_input_transition -max 0.16 [get_ports {data_in[2][59]}]
set_input_transition -min 0.003 [get_ports {data_in[2][58]}]
set_input_transition -max 0.16 [get_ports {data_in[2][58]}]
set_input_transition -min 0.003 [get_ports {data_in[2][57]}]
set_input_transition -max 0.16 [get_ports {data_in[2][57]}]
set_input_transition -min 0.003 [get_ports {data_in[2][56]}]
set_input_transition -max 0.16 [get_ports {data_in[2][56]}]
set_input_transition -min 0.003 [get_ports {data_in[2][55]}]
set_input_transition -max 0.16 [get_ports {data_in[2][55]}]
set_input_transition -min 0.003 [get_ports {data_in[2][54]}]
set_input_transition -max 0.16 [get_ports {data_in[2][54]}]
set_input_transition -min 0.003 [get_ports {data_in[2][53]}]
set_input_transition -max 0.16 [get_ports {data_in[2][53]}]
set_input_transition -min 0.003 [get_ports {data_in[2][52]}]
set_input_transition -max 0.16 [get_ports {data_in[2][52]}]
set_input_transition -min 0.003 [get_ports {data_in[2][51]}]
set_input_transition -max 0.16 [get_ports {data_in[2][51]}]
set_input_transition -min 0.003 [get_ports {data_in[2][50]}]
set_input_transition -max 0.16 [get_ports {data_in[2][50]}]
set_input_transition -min 0.003 [get_ports {data_in[2][49]}]
set_input_transition -max 0.16 [get_ports {data_in[2][49]}]
set_input_transition -min 0.003 [get_ports {data_in[2][48]}]
set_input_transition -max 0.16 [get_ports {data_in[2][48]}]
set_input_transition -min 0.003 [get_ports {data_in[2][47]}]
set_input_transition -max 0.16 [get_ports {data_in[2][47]}]
set_input_transition -min 0.003 [get_ports {data_in[2][46]}]
set_input_transition -max 0.16 [get_ports {data_in[2][46]}]
set_input_transition -min 0.003 [get_ports {data_in[2][45]}]
set_input_transition -max 0.16 [get_ports {data_in[2][45]}]
set_input_transition -min 0.003 [get_ports {data_in[2][44]}]
set_input_transition -max 0.16 [get_ports {data_in[2][44]}]
set_input_transition -min 0.003 [get_ports {data_in[2][43]}]
set_input_transition -max 0.16 [get_ports {data_in[2][43]}]
set_input_transition -min 0.003 [get_ports {data_in[2][42]}]
set_input_transition -max 0.16 [get_ports {data_in[2][42]}]
set_input_transition -min 0.003 [get_ports {data_in[2][41]}]
set_input_transition -max 0.16 [get_ports {data_in[2][41]}]
set_input_transition -min 0.003 [get_ports {data_in[2][40]}]
set_input_transition -max 0.16 [get_ports {data_in[2][40]}]
set_input_transition -min 0.003 [get_ports {data_in[2][39]}]
set_input_transition -max 0.16 [get_ports {data_in[2][39]}]
set_input_transition -min 0.003 [get_ports {data_in[2][38]}]
set_input_transition -max 0.16 [get_ports {data_in[2][38]}]
set_input_transition -min 0.003 [get_ports {data_in[2][37]}]
set_input_transition -max 0.16 [get_ports {data_in[2][37]}]
set_input_transition -min 0.003 [get_ports {data_in[2][36]}]
set_input_transition -max 0.16 [get_ports {data_in[2][36]}]
set_input_transition -min 0.003 [get_ports {data_in[2][35]}]
set_input_transition -max 0.16 [get_ports {data_in[2][35]}]
set_input_transition -min 0.003 [get_ports {data_in[2][34]}]
set_input_transition -max 0.16 [get_ports {data_in[2][34]}]
set_input_transition -min 0.003 [get_ports {data_in[2][33]}]
set_input_transition -max 0.16 [get_ports {data_in[2][33]}]
set_input_transition -min 0.003 [get_ports {data_in[2][32]}]
set_input_transition -max 0.16 [get_ports {data_in[2][32]}]
set_input_transition -min 0.003 [get_ports {data_in[2][31]}]
set_input_transition -max 0.16 [get_ports {data_in[2][31]}]
set_input_transition -min 0.003 [get_ports {data_in[2][30]}]
set_input_transition -max 0.16 [get_ports {data_in[2][30]}]
set_input_transition -min 0.003 [get_ports {data_in[2][29]}]
set_input_transition -max 0.16 [get_ports {data_in[2][29]}]
set_input_transition -min 0.003 [get_ports {data_in[2][28]}]
set_input_transition -max 0.16 [get_ports {data_in[2][28]}]
set_input_transition -min 0.003 [get_ports {data_in[2][27]}]
set_input_transition -max 0.16 [get_ports {data_in[2][27]}]
set_input_transition -min 0.003 [get_ports {data_in[2][26]}]
set_input_transition -max 0.16 [get_ports {data_in[2][26]}]
set_input_transition -min 0.003 [get_ports {data_in[2][25]}]
set_input_transition -max 0.16 [get_ports {data_in[2][25]}]
set_input_transition -min 0.003 [get_ports {data_in[2][24]}]
set_input_transition -max 0.16 [get_ports {data_in[2][24]}]
set_input_transition -min 0.003 [get_ports {data_in[2][23]}]
set_input_transition -max 0.16 [get_ports {data_in[2][23]}]
set_input_transition -min 0.003 [get_ports {data_in[2][22]}]
set_input_transition -max 0.16 [get_ports {data_in[2][22]}]
set_input_transition -min 0.003 [get_ports {data_in[2][21]}]
set_input_transition -max 0.16 [get_ports {data_in[2][21]}]
set_input_transition -min 0.003 [get_ports {data_in[2][20]}]
set_input_transition -max 0.16 [get_ports {data_in[2][20]}]
set_input_transition -min 0.003 [get_ports {data_in[2][19]}]
set_input_transition -max 0.16 [get_ports {data_in[2][19]}]
set_input_transition -min 0.003 [get_ports {data_in[2][18]}]
set_input_transition -max 0.16 [get_ports {data_in[2][18]}]
set_input_transition -min 0.003 [get_ports {data_in[2][17]}]
set_input_transition -max 0.16 [get_ports {data_in[2][17]}]
set_input_transition -min 0.003 [get_ports {data_in[2][16]}]
set_input_transition -max 0.16 [get_ports {data_in[2][16]}]
set_input_transition -min 0.003 [get_ports {data_in[2][15]}]
set_input_transition -max 0.16 [get_ports {data_in[2][15]}]
set_input_transition -min 0.003 [get_ports {data_in[2][14]}]
set_input_transition -max 0.16 [get_ports {data_in[2][14]}]
set_input_transition -min 0.003 [get_ports {data_in[2][13]}]
set_input_transition -max 0.16 [get_ports {data_in[2][13]}]
set_input_transition -min 0.003 [get_ports {data_in[2][12]}]
set_input_transition -max 0.16 [get_ports {data_in[2][12]}]
set_input_transition -min 0.003 [get_ports {data_in[2][11]}]
set_input_transition -max 0.16 [get_ports {data_in[2][11]}]
set_input_transition -min 0.003 [get_ports {data_in[2][10]}]
set_input_transition -max 0.16 [get_ports {data_in[2][10]}]
set_input_transition -min 0.003 [get_ports {data_in[2][9]}]
set_input_transition -max 0.16 [get_ports {data_in[2][9]}]
set_input_transition -min 0.003 [get_ports {data_in[2][8]}]
set_input_transition -max 0.16 [get_ports {data_in[2][8]}]
set_input_transition -min 0.003 [get_ports {data_in[2][7]}]
set_input_transition -max 0.16 [get_ports {data_in[2][7]}]
set_input_transition -min 0.003 [get_ports {data_in[2][6]}]
set_input_transition -max 0.16 [get_ports {data_in[2][6]}]
set_input_transition -min 0.003 [get_ports {data_in[2][5]}]
set_input_transition -max 0.16 [get_ports {data_in[2][5]}]
set_input_transition -min 0.003 [get_ports {data_in[2][4]}]
set_input_transition -max 0.16 [get_ports {data_in[2][4]}]
set_input_transition -min 0.003 [get_ports {data_in[2][3]}]
set_input_transition -max 0.16 [get_ports {data_in[2][3]}]
set_input_transition -min 0.003 [get_ports {data_in[2][2]}]
set_input_transition -max 0.16 [get_ports {data_in[2][2]}]
set_input_transition -min 0.003 [get_ports {data_in[2][1]}]
set_input_transition -max 0.16 [get_ports {data_in[2][1]}]
set_input_transition -min 0.003 [get_ports {data_in[2][0]}]
set_input_transition -max 0.16 [get_ports {data_in[2][0]}]
set_input_transition -min 0.003 [get_ports {data_in[3][63]}]
set_input_transition -max 0.16 [get_ports {data_in[3][63]}]
set_input_transition -min 0.003 [get_ports {data_in[3][62]}]
set_input_transition -max 0.16 [get_ports {data_in[3][62]}]
set_input_transition -min 0.003 [get_ports {data_in[3][61]}]
set_input_transition -max 0.16 [get_ports {data_in[3][61]}]
set_input_transition -min 0.003 [get_ports {data_in[3][60]}]
set_input_transition -max 0.16 [get_ports {data_in[3][60]}]
set_input_transition -min 0.003 [get_ports {data_in[3][59]}]
set_input_transition -max 0.16 [get_ports {data_in[3][59]}]
set_input_transition -min 0.003 [get_ports {data_in[3][58]}]
set_input_transition -max 0.16 [get_ports {data_in[3][58]}]
set_input_transition -min 0.003 [get_ports {data_in[3][57]}]
set_input_transition -max 0.16 [get_ports {data_in[3][57]}]
set_input_transition -min 0.003 [get_ports {data_in[3][56]}]
set_input_transition -max 0.16 [get_ports {data_in[3][56]}]
set_input_transition -min 0.003 [get_ports {data_in[3][55]}]
set_input_transition -max 0.16 [get_ports {data_in[3][55]}]
set_input_transition -min 0.003 [get_ports {data_in[3][54]}]
set_input_transition -max 0.16 [get_ports {data_in[3][54]}]
set_input_transition -min 0.003 [get_ports {data_in[3][53]}]
set_input_transition -max 0.16 [get_ports {data_in[3][53]}]
set_input_transition -min 0.003 [get_ports {data_in[3][52]}]
set_input_transition -max 0.16 [get_ports {data_in[3][52]}]
set_input_transition -min 0.003 [get_ports {data_in[3][51]}]
set_input_transition -max 0.16 [get_ports {data_in[3][51]}]
set_input_transition -min 0.003 [get_ports {data_in[3][50]}]
set_input_transition -max 0.16 [get_ports {data_in[3][50]}]
set_input_transition -min 0.003 [get_ports {data_in[3][49]}]
set_input_transition -max 0.16 [get_ports {data_in[3][49]}]
set_input_transition -min 0.003 [get_ports {data_in[3][48]}]
set_input_transition -max 0.16 [get_ports {data_in[3][48]}]
set_input_transition -min 0.003 [get_ports {data_in[3][47]}]
set_input_transition -max 0.16 [get_ports {data_in[3][47]}]
set_input_transition -min 0.003 [get_ports {data_in[3][46]}]
set_input_transition -max 0.16 [get_ports {data_in[3][46]}]
set_input_transition -min 0.003 [get_ports {data_in[3][45]}]
set_input_transition -max 0.16 [get_ports {data_in[3][45]}]
set_input_transition -min 0.003 [get_ports {data_in[3][44]}]
set_input_transition -max 0.16 [get_ports {data_in[3][44]}]
set_input_transition -min 0.003 [get_ports {data_in[3][43]}]
set_input_transition -max 0.16 [get_ports {data_in[3][43]}]
set_input_transition -min 0.003 [get_ports {data_in[3][42]}]
set_input_transition -max 0.16 [get_ports {data_in[3][42]}]
set_input_transition -min 0.003 [get_ports {data_in[3][41]}]
set_input_transition -max 0.16 [get_ports {data_in[3][41]}]
set_input_transition -min 0.003 [get_ports {data_in[3][40]}]
set_input_transition -max 0.16 [get_ports {data_in[3][40]}]
set_input_transition -min 0.003 [get_ports {data_in[3][39]}]
set_input_transition -max 0.16 [get_ports {data_in[3][39]}]
set_input_transition -min 0.003 [get_ports {data_in[3][38]}]
set_input_transition -max 0.16 [get_ports {data_in[3][38]}]
set_input_transition -min 0.003 [get_ports {data_in[3][37]}]
set_input_transition -max 0.16 [get_ports {data_in[3][37]}]
set_input_transition -min 0.003 [get_ports {data_in[3][36]}]
set_input_transition -max 0.16 [get_ports {data_in[3][36]}]
set_input_transition -min 0.003 [get_ports {data_in[3][35]}]
set_input_transition -max 0.16 [get_ports {data_in[3][35]}]
set_input_transition -min 0.003 [get_ports {data_in[3][34]}]
set_input_transition -max 0.16 [get_ports {data_in[3][34]}]
set_input_transition -min 0.003 [get_ports {data_in[3][33]}]
set_input_transition -max 0.16 [get_ports {data_in[3][33]}]
set_input_transition -min 0.003 [get_ports {data_in[3][32]}]
set_input_transition -max 0.16 [get_ports {data_in[3][32]}]
set_input_transition -min 0.003 [get_ports {data_in[3][31]}]
set_input_transition -max 0.16 [get_ports {data_in[3][31]}]
set_input_transition -min 0.003 [get_ports {data_in[3][30]}]
set_input_transition -max 0.16 [get_ports {data_in[3][30]}]
set_input_transition -min 0.003 [get_ports {data_in[3][29]}]
set_input_transition -max 0.16 [get_ports {data_in[3][29]}]
set_input_transition -min 0.003 [get_ports {data_in[3][28]}]
set_input_transition -max 0.16 [get_ports {data_in[3][28]}]
set_input_transition -min 0.003 [get_ports {data_in[3][27]}]
set_input_transition -max 0.16 [get_ports {data_in[3][27]}]
set_input_transition -min 0.003 [get_ports {data_in[3][26]}]
set_input_transition -max 0.16 [get_ports {data_in[3][26]}]
set_input_transition -min 0.003 [get_ports {data_in[3][25]}]
set_input_transition -max 0.16 [get_ports {data_in[3][25]}]
set_input_transition -min 0.003 [get_ports {data_in[3][24]}]
set_input_transition -max 0.16 [get_ports {data_in[3][24]}]
set_input_transition -min 0.003 [get_ports {data_in[3][23]}]
set_input_transition -max 0.16 [get_ports {data_in[3][23]}]
set_input_transition -min 0.003 [get_ports {data_in[3][22]}]
set_input_transition -max 0.16 [get_ports {data_in[3][22]}]
set_input_transition -min 0.003 [get_ports {data_in[3][21]}]
set_input_transition -max 0.16 [get_ports {data_in[3][21]}]
set_input_transition -min 0.003 [get_ports {data_in[3][20]}]
set_input_transition -max 0.16 [get_ports {data_in[3][20]}]
set_input_transition -min 0.003 [get_ports {data_in[3][19]}]
set_input_transition -max 0.16 [get_ports {data_in[3][19]}]
set_input_transition -min 0.003 [get_ports {data_in[3][18]}]
set_input_transition -max 0.16 [get_ports {data_in[3][18]}]
set_input_transition -min 0.003 [get_ports {data_in[3][17]}]
set_input_transition -max 0.16 [get_ports {data_in[3][17]}]
set_input_transition -min 0.003 [get_ports {data_in[3][16]}]
set_input_transition -max 0.16 [get_ports {data_in[3][16]}]
set_input_transition -min 0.003 [get_ports {data_in[3][15]}]
set_input_transition -max 0.16 [get_ports {data_in[3][15]}]
set_input_transition -min 0.003 [get_ports {data_in[3][14]}]
set_input_transition -max 0.16 [get_ports {data_in[3][14]}]
set_input_transition -min 0.003 [get_ports {data_in[3][13]}]
set_input_transition -max 0.16 [get_ports {data_in[3][13]}]
set_input_transition -min 0.003 [get_ports {data_in[3][12]}]
set_input_transition -max 0.16 [get_ports {data_in[3][12]}]
set_input_transition -min 0.003 [get_ports {data_in[3][11]}]
set_input_transition -max 0.16 [get_ports {data_in[3][11]}]
set_input_transition -min 0.003 [get_ports {data_in[3][10]}]
set_input_transition -max 0.16 [get_ports {data_in[3][10]}]
set_input_transition -min 0.003 [get_ports {data_in[3][9]}]
set_input_transition -max 0.16 [get_ports {data_in[3][9]}]
set_input_transition -min 0.003 [get_ports {data_in[3][8]}]
set_input_transition -max 0.16 [get_ports {data_in[3][8]}]
set_input_transition -min 0.003 [get_ports {data_in[3][7]}]
set_input_transition -max 0.16 [get_ports {data_in[3][7]}]
set_input_transition -min 0.003 [get_ports {data_in[3][6]}]
set_input_transition -max 0.16 [get_ports {data_in[3][6]}]
set_input_transition -min 0.003 [get_ports {data_in[3][5]}]
set_input_transition -max 0.16 [get_ports {data_in[3][5]}]
set_input_transition -min 0.003 [get_ports {data_in[3][4]}]
set_input_transition -max 0.16 [get_ports {data_in[3][4]}]
set_input_transition -min 0.003 [get_ports {data_in[3][3]}]
set_input_transition -max 0.16 [get_ports {data_in[3][3]}]
set_input_transition -min 0.003 [get_ports {data_in[3][2]}]
set_input_transition -max 0.16 [get_ports {data_in[3][2]}]
set_input_transition -min 0.003 [get_ports {data_in[3][1]}]
set_input_transition -max 0.16 [get_ports {data_in[3][1]}]
set_input_transition -min 0.003 [get_ports {data_in[3][0]}]
set_input_transition -max 0.16 [get_ports {data_in[3][0]}]
set_input_transition -min 0.003 [get_ports {data_in[4][63]}]
set_input_transition -max 0.16 [get_ports {data_in[4][63]}]
set_input_transition -min 0.003 [get_ports {data_in[4][62]}]
set_input_transition -max 0.16 [get_ports {data_in[4][62]}]
set_input_transition -min 0.003 [get_ports {data_in[4][61]}]
set_input_transition -max 0.16 [get_ports {data_in[4][61]}]
set_input_transition -min 0.003 [get_ports {data_in[4][60]}]
set_input_transition -max 0.16 [get_ports {data_in[4][60]}]
set_input_transition -min 0.003 [get_ports {data_in[4][59]}]
set_input_transition -max 0.16 [get_ports {data_in[4][59]}]
set_input_transition -min 0.003 [get_ports {data_in[4][58]}]
set_input_transition -max 0.16 [get_ports {data_in[4][58]}]
set_input_transition -min 0.003 [get_ports {data_in[4][57]}]
set_input_transition -max 0.16 [get_ports {data_in[4][57]}]
set_input_transition -min 0.003 [get_ports {data_in[4][56]}]
set_input_transition -max 0.16 [get_ports {data_in[4][56]}]
set_input_transition -min 0.003 [get_ports {data_in[4][55]}]
set_input_transition -max 0.16 [get_ports {data_in[4][55]}]
set_input_transition -min 0.003 [get_ports {data_in[4][54]}]
set_input_transition -max 0.16 [get_ports {data_in[4][54]}]
set_input_transition -min 0.003 [get_ports {data_in[4][53]}]
set_input_transition -max 0.16 [get_ports {data_in[4][53]}]
set_input_transition -min 0.003 [get_ports {data_in[4][52]}]
set_input_transition -max 0.16 [get_ports {data_in[4][52]}]
set_input_transition -min 0.003 [get_ports {data_in[4][51]}]
set_input_transition -max 0.16 [get_ports {data_in[4][51]}]
set_input_transition -min 0.003 [get_ports {data_in[4][50]}]
set_input_transition -max 0.16 [get_ports {data_in[4][50]}]
set_input_transition -min 0.003 [get_ports {data_in[4][49]}]
set_input_transition -max 0.16 [get_ports {data_in[4][49]}]
set_input_transition -min 0.003 [get_ports {data_in[4][48]}]
set_input_transition -max 0.16 [get_ports {data_in[4][48]}]
set_input_transition -min 0.003 [get_ports {data_in[4][47]}]
set_input_transition -max 0.16 [get_ports {data_in[4][47]}]
set_input_transition -min 0.003 [get_ports {data_in[4][46]}]
set_input_transition -max 0.16 [get_ports {data_in[4][46]}]
set_input_transition -min 0.003 [get_ports {data_in[4][45]}]
set_input_transition -max 0.16 [get_ports {data_in[4][45]}]
set_input_transition -min 0.003 [get_ports {data_in[4][44]}]
set_input_transition -max 0.16 [get_ports {data_in[4][44]}]
set_input_transition -min 0.003 [get_ports {data_in[4][43]}]
set_input_transition -max 0.16 [get_ports {data_in[4][43]}]
set_input_transition -min 0.003 [get_ports {data_in[4][42]}]
set_input_transition -max 0.16 [get_ports {data_in[4][42]}]
set_input_transition -min 0.003 [get_ports {data_in[4][41]}]
set_input_transition -max 0.16 [get_ports {data_in[4][41]}]
set_input_transition -min 0.003 [get_ports {data_in[4][40]}]
set_input_transition -max 0.16 [get_ports {data_in[4][40]}]
set_input_transition -min 0.003 [get_ports {data_in[4][39]}]
set_input_transition -max 0.16 [get_ports {data_in[4][39]}]
set_input_transition -min 0.003 [get_ports {data_in[4][38]}]
set_input_transition -max 0.16 [get_ports {data_in[4][38]}]
set_input_transition -min 0.003 [get_ports {data_in[4][37]}]
set_input_transition -max 0.16 [get_ports {data_in[4][37]}]
set_input_transition -min 0.003 [get_ports {data_in[4][36]}]
set_input_transition -max 0.16 [get_ports {data_in[4][36]}]
set_input_transition -min 0.003 [get_ports {data_in[4][35]}]
set_input_transition -max 0.16 [get_ports {data_in[4][35]}]
set_input_transition -min 0.003 [get_ports {data_in[4][34]}]
set_input_transition -max 0.16 [get_ports {data_in[4][34]}]
set_input_transition -min 0.003 [get_ports {data_in[4][33]}]
set_input_transition -max 0.16 [get_ports {data_in[4][33]}]
set_input_transition -min 0.003 [get_ports {data_in[4][32]}]
set_input_transition -max 0.16 [get_ports {data_in[4][32]}]
set_input_transition -min 0.003 [get_ports {data_in[4][31]}]
set_input_transition -max 0.16 [get_ports {data_in[4][31]}]
set_input_transition -min 0.003 [get_ports {data_in[4][30]}]
set_input_transition -max 0.16 [get_ports {data_in[4][30]}]
set_input_transition -min 0.003 [get_ports {data_in[4][29]}]
set_input_transition -max 0.16 [get_ports {data_in[4][29]}]
set_input_transition -min 0.003 [get_ports {data_in[4][28]}]
set_input_transition -max 0.16 [get_ports {data_in[4][28]}]
set_input_transition -min 0.003 [get_ports {data_in[4][27]}]
set_input_transition -max 0.16 [get_ports {data_in[4][27]}]
set_input_transition -min 0.003 [get_ports {data_in[4][26]}]
set_input_transition -max 0.16 [get_ports {data_in[4][26]}]
set_input_transition -min 0.003 [get_ports {data_in[4][25]}]
set_input_transition -max 0.16 [get_ports {data_in[4][25]}]
set_input_transition -min 0.003 [get_ports {data_in[4][24]}]
set_input_transition -max 0.16 [get_ports {data_in[4][24]}]
set_input_transition -min 0.003 [get_ports {data_in[4][23]}]
set_input_transition -max 0.16 [get_ports {data_in[4][23]}]
set_input_transition -min 0.003 [get_ports {data_in[4][22]}]
set_input_transition -max 0.16 [get_ports {data_in[4][22]}]
set_input_transition -min 0.003 [get_ports {data_in[4][21]}]
set_input_transition -max 0.16 [get_ports {data_in[4][21]}]
set_input_transition -min 0.003 [get_ports {data_in[4][20]}]
set_input_transition -max 0.16 [get_ports {data_in[4][20]}]
set_input_transition -min 0.003 [get_ports {data_in[4][19]}]
set_input_transition -max 0.16 [get_ports {data_in[4][19]}]
set_input_transition -min 0.003 [get_ports {data_in[4][18]}]
set_input_transition -max 0.16 [get_ports {data_in[4][18]}]
set_input_transition -min 0.003 [get_ports {data_in[4][17]}]
set_input_transition -max 0.16 [get_ports {data_in[4][17]}]
set_input_transition -min 0.003 [get_ports {data_in[4][16]}]
set_input_transition -max 0.16 [get_ports {data_in[4][16]}]
set_input_transition -min 0.003 [get_ports {data_in[4][15]}]
set_input_transition -max 0.16 [get_ports {data_in[4][15]}]
set_input_transition -min 0.003 [get_ports {data_in[4][14]}]
set_input_transition -max 0.16 [get_ports {data_in[4][14]}]
set_input_transition -min 0.003 [get_ports {data_in[4][13]}]
set_input_transition -max 0.16 [get_ports {data_in[4][13]}]
set_input_transition -min 0.003 [get_ports {data_in[4][12]}]
set_input_transition -max 0.16 [get_ports {data_in[4][12]}]
set_input_transition -min 0.003 [get_ports {data_in[4][11]}]
set_input_transition -max 0.16 [get_ports {data_in[4][11]}]
set_input_transition -min 0.003 [get_ports {data_in[4][10]}]
set_input_transition -max 0.16 [get_ports {data_in[4][10]}]
set_input_transition -min 0.003 [get_ports {data_in[4][9]}]
set_input_transition -max 0.16 [get_ports {data_in[4][9]}]
set_input_transition -min 0.003 [get_ports {data_in[4][8]}]
set_input_transition -max 0.16 [get_ports {data_in[4][8]}]
set_input_transition -min 0.003 [get_ports {data_in[4][7]}]
set_input_transition -max 0.16 [get_ports {data_in[4][7]}]
set_input_transition -min 0.003 [get_ports {data_in[4][6]}]
set_input_transition -max 0.16 [get_ports {data_in[4][6]}]
set_input_transition -min 0.003 [get_ports {data_in[4][5]}]
set_input_transition -max 0.16 [get_ports {data_in[4][5]}]
set_input_transition -min 0.003 [get_ports {data_in[4][4]}]
set_input_transition -max 0.16 [get_ports {data_in[4][4]}]
set_input_transition -min 0.003 [get_ports {data_in[4][3]}]
set_input_transition -max 0.16 [get_ports {data_in[4][3]}]
set_input_transition -min 0.003 [get_ports {data_in[4][2]}]
set_input_transition -max 0.16 [get_ports {data_in[4][2]}]
set_input_transition -min 0.003 [get_ports {data_in[4][1]}]
set_input_transition -max 0.16 [get_ports {data_in[4][1]}]
set_input_transition -min 0.003 [get_ports {data_in[4][0]}]
set_input_transition -max 0.16 [get_ports {data_in[4][0]}]
set_input_transition -min 0.003 [get_ports {credit_i[4]}]
set_input_transition -max 0.16 [get_ports {credit_i[4]}]
set_input_transition -min 0.003 [get_ports {credit_i[3]}]
set_input_transition -max 0.16 [get_ports {credit_i[3]}]
set_input_transition -min 0.003 [get_ports {credit_i[2]}]
set_input_transition -max 0.16 [get_ports {credit_i[2]}]
set_input_transition -min 0.003 [get_ports {credit_i[1]}]
set_input_transition -max 0.16 [get_ports {credit_i[1]}]
set_input_transition -min 0.003 [get_ports {credit_i[0]}]
set_input_transition -max 0.16 [get_ports {credit_i[0]}]
set_wire_load_selection_group "default_by_area" -library "CORE65GPSVT"
