##############################################################
##         Initial Encounter Configuration                  ##
## Script Generated for Undergrad class of microelectronics ##
## Generated by Matheus Moreira/Fernando Moraes - 2018      ##
## GAPH/FACIN/PUCRS                                         ##
##                                                          ##
## Functionalities of this script:                          ##
##  -Route the design with nanoroute                        ##
##############################################################
##Reroute the design
#set_db  route_with_timing_driven 0 

route_design -global

route_detail

route_global_detail

check_design -all

report_timing

check_drc
